function! VimEmoji()
 iabbr :smile: 😃
 iabbr :joyful: 🤣
 iabbr :heart: ❤️
 iabbr :floppy: 💾
 iabbr :apple: 🍎
 iabbr :fox: 🦊
 iabbr :fish: 🐠
 iabbr :java: ♨️
 iabbr :time: ⌛
 iabbr :sad: 😞
 iabbr :face: 🙂
 iabbr :bomb: 💣
 iabbr :film: 🎥
 iabbr :fire: 🔥
 iabbr :gnu: 🐃
 iabbr :play: ▶️
 iabbr :music: 🎵
 iabbr :book: 📘
 iabbr :fheart: 😍
 iabbr :vomit: 🤮
 iabbr :clock: ⏰
 iabbr :locked: 🔒
 iabbr :linux: 🐧
 iabbr :cow: 🐄
 iabbr :wifi: 📶
 iabbr :block: 🚫
 iabbr :link: 🔗
 iabbr :crazy: 😛
 iabbr :angry: 😡
 iabbr :game: 🎮
 iabbr :burguer: 🍔
 iabbr :world: 🌎
 iabbr :mouse: 🐁
 iabbr :check: ✅
 iabbr :up: ⬆️
 iabbr :key: 🔑
 iabbr :glass: 😎
 iabbr :poop: 💩
 iabbr :pc: 💻
 iabbr :cake: 🎂
 iabbr :black: ✊
 iabbr :python: 🐍
 iabbr :close: ❌
 iabbr :trophy: 🏆
 iabbr :clip: 📎
 iabbr :daemon: 😈
 iabbr :clown: 🤡
 iabbr :keyb: ⌨️
 iabbr :beer: 🍺
 iabbr :rainbow: 🌈
 iabbr :docker: 🐳
 iabbr :circle: 🔵
 iabbr :light: 💡
 iabbr :folder: 📁
 iabbr :openfolder: 📂
 iabbr :plus: ➕
 iabbr :rocket: 🚀
endfunction

function! ShowEmoji()
 echo "┌─────────┬────┐ ┌─────────┬────┐ ┌─────────┬────┐ ┌─────────┬────┐ ┌─────────┬────┐ ┌─────────┬────┐ ┌─────────┬────┐ ┌─────────┬────┐ ┌─────────┬────┐"
 echo "│:smile:  │ 😃 │ │:joyful: │ 🤣 │ │:heart:  │ ❤️  │ │:floppy: │ 💾 │ │:apple:  │ 🍎 │ │:fox:    │ 🦊 │ │:fish:   │ 🐠 │ │:java:   │ ♨️  │ │:time:   │ ⌛ │"
 echo "├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤"
 echo "│:sad:    │ 😞 │ │:face:   │ 🙂 │ │:bomb:   │ 💣 │ │:film:   │ 🎥 │ │:fire:   │ 🔥 │ │:gnu:    │ 🐃 │ │:play:   │ ▶️  │ │:music:  │ 🎵 │ │:book:   │ 📘 │"
 echo "├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤"
 echo "│:fheart: │ 😍 │ │:vomit:  │ 🤮 │ │:clock:  │ ⏰ │ │:locked: │ 🔒 │ │:linux:  │ 🐧 │ │:cow:    │ 🐄 │ │:wifi:   │ 📶 │ │:block:  │ 🚫 │ │:link:   │ 🔗 │"
 echo "├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤"
 echo "│:crazy:  │ 😛 │ │:angry:  │ 😡 │ │:game:   │ 🎮 │ │:burguer:│ 🍔 │ │:world:  │ 🌎 │ │:mouse:  │ 🐁 │ │:check:  │ ✔️  │ │:up:     │ ⬆️  │ │:key:    │ 🔑 │"
 echo "├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤"
 echo "│:glass:  │ 😎 │ │:poop:   │ 💩 │ │:pc:     │ 💻 │ │:cake:   │ 🎂 │ │:black:  │ ✊ │ │:python: │ 🐍 │ │:close:  │ ❌ │ │:trophy: │ 🏆 │ │:clip:   │ 📎 │"
 echo "├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤ ├─────────┼────┤"
 echo "│:daemon: │ 😈 │ │:clown:  │ 🤡 │ │:keyb:   │ ⌨️  │ │:beer:   │ 🍺 │ │:rainbow:│ 🌈 │ │:docker: │ 🐳 │ │:circle: │ 🔵 │ │:light:  │ 💡 │ │:folder: │ 📁 │"
 echo "└─────────┴────┘ └─────────┴────┘ └─────────┴────┘ └─────────┴────┘ └─────────┴────┘ └─────────┴────┘ └─────────┴────┘ └─────────┴────┘ └─────────┴────┘"
 echo " News → :openfolder: 📂 | :plus: ➕ | :rocket: 🚀 | "
endfunction

:call VimEmoji()
:command ShowEmoji :call ShowEmoji()
